In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Question 1

In [2]:
df1 = df
for i in range(len(df1)):
    if str(df1['FlightNumber'][i]) == str('nan'):
        df1['FlightNumber'][i] = df1['FlightNumber'][i-1]+10
df1['FlightNumber'] = df1['FlightNumber'].astype(int)
print(df1.dtypes)
df1

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

<ipython-input-2-74d2029eb9a8>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['FlightNumber'][i] = df1['FlightNumber'][i-1]+10

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## Question 2

In [3]:
df2 = pd.DataFrame(columns=['From','To'])
df2['From'] = df1['From_To'].apply(lambda x: x.split('_')[0])
df2['To'] = df1['From_To'].apply(lambda x: x.split('_')[1])
df2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## Question 3

In [4]:
df2['From'] = df2['From'].apply(lambda x: x.capitalize())
df2['To'] = df2['To'].apply(lambda x: x.capitalize())
df2

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## Question 4

In [5]:
df1.drop(columns=['From_To'],inplace=True)
df3 = pd.concat([df1,df2],axis=1)
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Question 5

In [6]:
recentDelays = df3[['RecentDelays']]
recentDelays

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [7]:
lst = []
for i in range(len(recentDelays['RecentDelays'])):
    lst.append(recentDelays['RecentDelays'].iloc[i])
lst

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [8]:
delaysdf = pd.DataFrame(lst, columns=[f'delay_{i}' for i in range(3)])
delaysdf

   delay_0  delay_1  delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [9]:
df_comb = pd.concat([df3,delaysdf], axis=1)
df_comb

,FlightNumber,RecentDelays,Airline,From,To,delay_0,delay_1,delay_2
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [10]:
final_df = df_comb.drop(columns='RecentDelays')
final_df

,FlightNumber,Airline,From,To,delay_0,delay_1,delay_2
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN